# Дано положительное действительное число. Выведите его дробную часть.

x = float(input())
print(x % int(x))