# Даны пять чисел a_1, \, a_2, \, a_3, \, a_4, \, a_5a
# Напишите программу, которая вычисляет сумму их модулей |a_1| + |a_2| +|a_3| +|a_4| + |a_5|∣a

a, b, c, d, e = abs(float(input())), abs(float(input())), abs(float(input())), abs(float(input())), abs(float(input()))
print(a + b + c + d + e)
