# Две старушки идут навстречу друг другу с постоянными скоростями V_1 V_2
# Определите, через какое время старушки встретятся, если расстояние между ними равно S км.

S, v1, v2, = float(input()), float(input()), float(input())
t = S / (v1 + v2)
print(t)

