# Напишите программу, которая выводит текст:
#
# "Python is a great language!", said Fred. "I don't ever remember having this much fun before."
#
# Примечание. Используйте конкатенацию строк.

str_1 = '"Python is a great language!", said Fred. '
str_2 = '''"I don't ever remember having this much fun before."'''
str_3 = str_1 + str_2
print(str_3)
